# Рост дочерей 175, 167, 154, 174, 178, 148, 160, 167, 169, 170 Рост матерей  178, 165, 165, 173, 168, 155, 160, 164, 178, 175 Используя эти данные построить 95% доверительный интервал для разности среднего роста родителей и детей.
import numpy as np

def Serch_d(arr):
    d = 0
    for i in arr:
        d += (arr.mean() - i) ** 2
    d /= len(arr) - 1
    return d

mom = np.array([178, 165, 165, 173, 168, 155, 160, 164, 178, 175])
chil = np.array([175, 167, 154, 174, 178, 148, 160, 167, 169, 170])
n = 10
z = 1.96

x = mom.mean() - chil.mean()

print(x)

d_mom = Serch_d(mom)
d_chil = Serch_d(chil)

d = (d_mom + d_chil) / 2

s = d ** 0.5

se = s / ((2 * n) ** 0.5)

print(f'{x - se * z}; {x + se * z}') # (-1.91; 5.71)