# Есть ли статистически значимые различия в росте дочерей? Рост матерей 172, 177, 158, 170, 178,175, 164, 160, 169, 165 Рост взрослых дочерей: 173, 175, 162, 174, 175, 168, 155, 170, 160

import numpy as np

def Serch_d(arr):
    d = 0
    for i in arr:
        d += (arr.mean() - i) ** 2
    d /= len(arr) - 1
    return d

mom = np.array([172, 177, 158, 170, 178, 175, 164, 160, 169, 165])
chil = np.array([173, 175, 162, 174, 175, 168, 155, 170, 160])

d_mom = Serch_d(mom)
d_chil = Serch_d(chil)

d = (d_mom + d_chil) / 2
t = (mom.mean() - chil.mean()) / ((d / len(mom)) + (d / len(chil))) ** 0.5

print(t)
tkp = 2.26
# Статистически значимые различия отсутствуют так как t = 0,24 находится в диапазоне от -1,13 до 1,13